{"536 U.S. 1": "ROBERT J. DEVLIN v. ROBERT A. SCARDELLETTI et al.", "526 U.S. 295": "WYOMING v. SANDRA HOUGHTON", "526 U.S. 529": "WILLIAM J. CLINTON, PRESIDENT OF THE UNITED STATES, et al. v. JAMES T. GOLDSMITH", "522 U.S. 67": "MURPHY J. FOSTER, JR., GOVERNOR OF LOUISIANA, et al. v. G. SCOTT LOVE, PAUL S. BERGERON, KATHLEEN B. BALHOFF, AND BENNIE BAKER-BOURGEOIS", "526 U.S. 865": "AMOCO PRODUCTION COMPANY, ON BEHALF OF ITSELF AND THE CLASS IT REPRESENTS v. SOUTHERN UTE INDIAN TRIBE et al.", "530 U.S. 466": "CHARLES C. APPRENDI, JR. v. NEW JERSEY", "526 U.S. 40": "AMERICAN MANUFACTURERS MUTUAL INSURANCE COMPANY, et al. v. DELORES SCOTT SULLIVAN et al.", "519 U.S. 172": "JOHNNY LYNN OLD CHIEF v. UNITED STATES", "526 U.S. 358": "UNUM LIFE INSURANCE COMPANY OF AMERICA v. JOHN E. WARD", "532 U.S. 105": "CIRCUIT CITY STORES, INC. v. SAINT CLAIR ADAMS", "532 U.S. 782": "JOHN PAUL PENRY v. GARY L. JOHNSON, DIRECTOR, TEXAS DEPARTMENT OF CRIMINAL JUSTICE, INSTITUTIONAL DIVISION", "530 U.S. 793": "GUY MITCHELL, et al. v. MARY L. HELMS, et al.", "532 U.S. 318": "GAIL ATWATER, et al. v. CITY OF LAGO VISTA et al.", "531 U.S. 356": "BOARD OF TRUSTEES OF THE UNIVERSITY OF ALABAMA, et al., v. PATRICIA GARRETT, et al.", "521 U.S. 399": "DARYLL RICHARDSON AND JOHN WALKER v. RONNIE LEE MCKNIGHT", "522 U.S. 87": "RICHARD F. TREST v. BURL CAIN, WARDEN", "532 U.S. 424": "COOPER INDUSTRIES, INC. v. LEATHERMAN TOOL GROUP, INC.", "536 U.S. 452": "UTAH, et al. v. DONALD L. EVANS, SECRETARY OF COMMERCE, et al.", "531 U.S. 32": "CITY OF INDIANAPOLIS, et al. v. JAMES EDMOND et al.", "529 U.S. 576": "EDWARD CHRISTENSEN, et al. v. HARRIS COUNTY, et al.", "526 U.S. 227": "NATHANIEL JONES v. UNITED STATES", "525 U.S. 266": "VICKY M. LOPEZ, et al. v. MONTEREY COUNTY et al.", "520 U.S. 833": "SANDRA JEAN DALE BOGGS v. THOMAS F. BOGGS, HARRY M. BOGGS AND DAVID B. BOGGS", "536 U.S. 181": "KAY BARNES, ETC., et al. v. JEFFREY GORMAN", "519 U.S. 357": "PAUL SCHENCK AND DWIGHT SAUNDERS v. PRO-CHOICE NETWORK OF WESTERN NEW YORK et al.", "526 U.S. 172": "MINNESOTA, et al. v. MILLE LACS BAND OF CHIPPEWA INDIANS et al.", "530 U.S. 640": "BOY SCOUTS OF AMERICA AND MONMOUTH COUNCIL, et al. v. JAMES DALE", "533 U.S. 606": "ANTHONY PALAZZOLO v. RHODE ISLAND, et al.", "531 U.S. 57": "EASTERN ASSOCIATED COAL CORPORATION v. UNITED MINE WORKERS OF AMERICA, DISTRICT 17, et al.", "532 U.S. 588": "THE WHARF (HOLDINGS) LIMITED, et al. v. UNITED INTERNATIONAL HOLDINGS, INC. et al.", "520 U.S. 939": "HUGHES AIRCRAFT COMPANY v. UNITED STATES, ex rel. WILLIAM J. SCHUMER", "529 U.S. 803": "UNITED STATES, et al. v. PLAYBOY ENTERTAINMENT GROUP, INC.", "530 U.S. 156": "BOBBY LEE RAMDASS v. RONALD J. ANGELONE, DIRECTOR, VIRGINIA DEPARTMENT OF CORRECTIONS", "521 U.S. 179": "MARVIN KLEHR, ET UX. v. A. O. SMITH CORPORATION AND A. O. SMITH HARVESTORE PRODUCTS, INC.", "533 U.S. 98": "GOOD NEWS CLUB, et al. v. MILFORD CENTRAL SCHOOL", "520 U.S. 924": "JAMES E. GILBERT, PRESIDENT, EAST STROUDSBURG UNIVERSITY, et al. v. RICHARD HOMAR", "519 U.S. 148": "UNITED STATES v. CHERYL PUTRA", "526 U.S. 1": "FRANCOIS HOLLOWAY, AKA ABDU ALI v. UNITED STATES", "526 U.S. 574": "RUHRGAS AG v. MARATHON OIL COMPANY et al.", "529 U.S. 513": "SCOTT LESLIE CARMELL v. TEXAS", "528 U.S. 431": "DAVID H. BARAL v. UNITED STATES", "531 U.S. 198": "PAUL L. GLOVER v. UNITED STATES", "525 U.S. 299": "HUMANA INC., et al. v. MARY FORSYTH et al.", "527 U.S. 627": "FLORIDA PREPAID POSTSECONDARY EDUCATION EXPENSE BOARD v. COLLEGE SAVINGS BANK AND UNITED STATES", "530 U.S. 211": "LORI PEGRAM, et al. v. CYNTHIA HERDRICH", "520 U.S. 180": "TURNER BROADCASTING SYSTEM, INC., et al. v. FEDERAL COMMUNICATIONS COMMISSION et al.", "519 U.S. 213": "JOHN W. ATHERTON, JR. v. FEDERAL DEPOSIT INSURANCE CORPORATION, AS RECEIVER FOR CITY SAVINGS, F. S. B.", "520 U.S. 397": "BOARD OF THE COUNTY COMMISSIONERS OF BRYAN COUNTY, OKLAHOMA v. JILL BROWN et al.", "537 U.S. 71": "UNITED STATES, et al. v. THOMAS LAMAR BEAN", "531 U.S. 225": "WILLIAM FIORE v. GREGORY WHITE, WARDEN, et al.", "537 U.S. 36": "YELLOW TRANSPORTATION, INC. v. MICHIGAN, et al.", "520 U.S. 43": "ARIZONANS FOR OFFICIAL ENGLISH AND ROBERT D. PARK v. ARIZONA et al.", "529 U.S. 473": "ANTONIO TONTON SLACK v. ELDON MCDANIEL, WARDEN, et al.", "520 U.S. 806": "BARBARA A. DE BUONO, NEW YORK COMMISSIONER OF HEALTH, et al. v. NYSA-ILA MEDICAL AND CLINICAL SERVICES FUND, ETC., et al.", "531 U.S. 438": "JAMES F. LEWIS v. LEWIS & CLARK MARINE, INC., ETC.", "531 U.S. 70": "GEORGE W. BUSH v. PALM BEACH COUNTY CANVASSING BOARD, et al.", "521 U.S. 320": "AARON LINDH v. JAMES P. MURPHY, WARDEN", "527 U.S. 41": "CITY OF CHICAGO v. JESUS MORALES et al.", "520 U.S. 548": "HARBOR TUG AND BARGE COMPANY v. JOHN PAPAI ET UX.", "536 U.S. 73": "CHEVRON U.S.A. INC. v. MARIO ECHAZABAL", "526 U.S. 795": "CAROLYN C. CLEVELAND v. POLICY MANAGEMENT SYSTEMS CORPORATION et al.", "533 U.S. 353": "NEVADA, et al. v. FLOYD HICKS, et al.", "533 U.S. 262": "IDAHO v. UNITED STATES et al.", "521 U.S. 203": "CHANCELLOR, BOARD OF EDUCATION OF THE CITY OF NEW YORK, et al. v. BETTY-LOUISE FELTON et al.", "520 U.S. 821": "ARKANSAS v. FARM CREDIT SERVICES OF CENTRAL ARKANSAS et al.", "529 U.S. 53": "UNITED STATES v. ROY LEE JOHNSON", "534 U.S. 19": "TRW INC. v. ADELAIDE ANDREWS", "533 U.S. 158": "CEDRIC KUSHNER PROMOTIONS, LTD. v. DON KING, et al.", "525 U.S. 128": "NYNEX CORPORATION, et al. v. DISCON, INCORPORATED", "525 U.S. 471": "JANET RENO, ATTORNEY GENERAL, et al. v. AMERICAN-ARAB ANTI-DISCRIMINATION COMMITTEE, et al.", "537 U.S. 79": "KAREN HOWSAM, ETC. v. DEAN WITTER REYNOLDS, INC.", "531 U.S. 457": "AMERICAN TRUCKING ASSOCIATIONS, INC., et al. v. CHRISTINE TODD WHITMAN, ADMINISTRATOR OF ENVIRONMENTAL PROTECTION AGENCY, et al.", "533 U.S. 348": "DEBORIS CALCANO-MARTINEZ, et al. v. IMMIGRATION AND NATURALIZATION SERVICE", "521 U.S. 642": "UNITED STATES v. JAMES HERMAN O'HAGAN", "525 U.S. 83": "MINNESOTA v. WAYNE THOMAS CARTER", "526 U.S. 32": "ARIZONA DEPARTMENT OF REVENUE v. BLAZE CONSTRUCTION COMPANY, INC.", "532 U.S. 36": "WESLEY AARON SHAFER, JR. v. SOUTH CAROLINA", "520 U.S. 651": "JON E. EDMOND v. UNITED STATES", "535 U.S. 43": "CORNELIUS P. YOUNG, ET UX. v. UNITED STATES", "534 U.S. 516": "CORRECTION OFFICER PORTER, et al. v. RONALD NUSSLE", "534 U.S. 246": "WILLIAM ARTHUR KELLY v. SOUTH CAROLINA", "536 U.S. 765": "REPUBLICAN PARTY OF MINNESOTA, et al. v. SUZANNE WHITE, CHAIRPERSON, MINNESOTA BOARD OF JUDICIAL STANDARDS, et al.", "533 U.S. 289": "IMMIGRATION AND NATURALIZATION SERVICE v. ENRICO ST. CYR", "521 U.S. 702": "WASHINGTON, et al. v. HAROLD GLUCKSBERG et al.", "521 U.S. 898": "RICHARD MACK v. UNITED STATES", "520 U.S. 305": "WALKER L. CHANDLER, et al. v. ZELL D. MILLER, GOVERNOR OF GEORGIA, et al.", "533 U.S. 27": "DANNY LEE KYLLO v. UNITED STATES", "534 U.S. 362": "REMON LEE v. MIKE KEMNA, SUPERINTENDENT, CROSSROADS CORRECTIONAL CENTER", "532 U.S. 451": "WILBERT K. ROGERS v. TENNESSEE", "530 U.S. 428": "CHARLES THOMAS DICKERSON v. UNITED STATES", "534 U.S. 61": "CORRECTIONAL SERVICES CORPORATION v. JOHN E. MALESKO", "520 U.S. 641": "GARY EDWARDS AND TANA WOOD v. JERRY B. BALISOK", "526 U.S. 137": "KUMHO TIRE COMPANY, LTD., et al. v. PATRICK CARMICHAEL, ETC., et al.", "520 U.S. 899": "WILLIAM BRACY v. RICHARD B. GRAMLEY, WARDEN", "534 U.S. 266": "UNITED STATES v. RALPH ARVIZU", "534 U.S. 124": "J. E. M. AG SUPPLY, INC., DBA FARM ADVANTAGE, INC., et al. v. PIONEER HI-BRED INTERNATIONAL, INC.", "531 U.S. 250": "MARK SELING, SUPERINTENDENT, SPECIAL COMMITMENT CENTER v. ANDRE BRIGHAM YOUNG", "531 U.S. 425": "CENTRAL GREEN CO. v. UNITED STATES", "520 U.S. 329": "LINDA J. BLESSING, DIRECTOR, ARIZONA DEPARTMENT OF ECONOMIC SECURITY v. CATHY FREESTONE, ETC., et al.", "530 U.S. 120": "JAIME CASTILLO, et al., v. UNITED STATES", "532 U.S. 59": "PAULA L. BUFORD v. UNITED STATES", "529 U.S. 753": "MARIA SUZUKI OHLER v. UNITED STATES", "531 U.S. 206": "DAVID A. GITLITZ, ET UX., et al. v. COMMISSIONER OF INTERNAL REVENUE", "519 U.S. 337": "CHARLES T. ROBINSON, SR. v. SHELL OIL COMPANY", "530 U.S. 57": "JENIFER TROXEL, ET VIR v. TOMMIE GRANVILLE", "536 U.S. 424": "CITY OF COLUMBUS, et al. v. OURS GARAGE AND WRECKER SERVICE, INC., et al.", "532 U.S. 843": "SHARON B. POLLARD v. E. I. DU PONT DE NEMOURS & COMPANY", "527 U.S. 308": "GRUPO MEXICANO DE DESARROLLO, S. A., et al. v. ALLIANCE BOND FUND, INC., et al.", "525 U.S. 432": "HUGHES AIRCRAFT COMPANY, et al. v. STANLEY I. JACOBSON et al.", "534 U.S. 316": "CAREN CRONK THOMAS AND WINDY CITY HEMP DEVELOPMENT BOARD v. CHICAGO PARK DISTRICT", "520 U.S. 143": "LEROY L. YOUNG, et al. v. ERNEST EUGENE HARPER", "529 U.S. 694": "CORNELL JOHNSON v. UNITED STATES", "526 U.S. 838": "WILLIAM D. O'SULLIVAN v. DARREN BOERCKEL", "525 U.S. 234": "CITY OF WEST COVINA v. LAWRENCE PERKINS et al.", "527 U.S. 229": "NATIONAL AERONAUTICS AND SPACE ADMINISTRATION, ETC., et al. v. FEDERAL LABOR RELATIONS AUTHORITY et al.", "526 U.S. 398": "UNITED STATES v. SUN-DIAMOND GROWERS OF CALIFORNIA", "522 U.S. 118": "LYNNE KALINA v. RODNEY FLETCHER", "536 U.S. 101": "NATIONAL RAILROAD PASSENGER CORPORATION v. ABNER MORGAN, JR.", "520 U.S. 93": "COMMISSIONER OF INTERNAL REVENUE v. ESTATE OF OTIS C. HUBERT, DECEASED, C & S SOVERAN TRUST COMPANY (GEORGIA) N. A., CO-EXECUTOR", "536 U.S. 194": "UNITED STATES v. CHRISTOPHER DRAYTON AND CLIFTON BROWN, JR.", "529 U.S. 277": "CITY OF ERIE, et al. v. PAP'S A. M., TDBA 'KANDYLAND'", "531 U.S. 230": "CHRISTOPHER A. LOPEZ v. RANDY J. DAVIS, WARDEN, et al.", "532 U.S. 275": "JAMES ALEXANDER, DIRECTOR, ALABAMA DEPARTMENT OF PUBLIC SAFETY, et al. v. MARTHA SANDOVAL, INDIVIDUALLY AND ON BEHALF OF ALL OTHERS SIMILARLY SITUATED", "526 U.S. 344": "MURPHY BROTHERS, INC. v. MICHETTI PIPE STRINGING, INC.", "528 U.S. 141": "JANET RENO, ATTORNEY GENERAL, et al. v. CHARLIE CONDON, ATTORNEY GENERAL OF SOUTH CAROLINA, et al.", "535 U.S. 625": "UNITED STATES v. LEONARD COTTON, MARQUETTE HALL, LAMONT THOMAS, MATILDA HALL, JOVAN POWELL, JESUS HALL, AND STANLEY HALL, JR.", "532 U.S. 598": "BUCKHANNON BOARD AND CARE HOME, INC., et al. v. WEST VIRGINIA DEPARTMENT OF HEALTH AND HUMAN RESOURCES, et al.", "537 U.S. 19": "JEANNE WOODFORD, WARDEN v. JOHN LOUIS VISCIOTTI", "527 U.S. 581": "TOMMY OLMSTEAD, COMMISSIONER, GEORGIA DEPARTMENT OF HUMAN RESOURCES, et al. v. L. C., BY JONATHAN ZIMRING, GUARDIAN AD LITEM AND NEXT FRIEND, et al.", "532 U.S. 1": "DEPARTMENT OF THE INTERIOR AND BUREAU OF INDIAN AFFAIRS v. KLAMATH WATER USERS PROTECTIVE ASSOCIATION", "521 U.S. 844": "JANET RENO, ATTORNEY GENERAL OF THE UNITED STATES, et al. v. AMERICAN CIVIL LIBERTIES UNION et al.", "520 U.S. 725": "BERNADINE SUITUM v. TAHOE REGIONAL PLANNING AGENCY", "528 U.S. 62": "UNITED STATES v. FLORIDA BOARD OF REGENTS et al.", "520 U.S. 461": "JOYCE B. JOHNSON v. UNITED STATES", "519 U.S. 425": "REGENTS OF THE UNIVERSITY OF CALIFORNIA, et al. v. JOHN DOE ETC.", "534 U.S. 112": "UNITED STATES v. MARK JAMES KNIGHTS", "527 U.S. 373": "LOUIS JONES v. UNITED STATES", "519 U.S. 316": "CALIFORNIA DIVISION OF LABOR STANDARDS ENFORCEMENT, et al. v. DILLINGHAM CONSTRUCTION, N. A., INC., AND MANUEL J. ARCEO, DBA SOUND SYSTEMS MEDIA", "535 U.S. 391": "US AIRWAYS, INC. v. ROBERT BARNETT", "533 U.S. 431": "FEDERAL ELECTION COMMISSION v. COLORADO REPUBLICAN FEDERAL CAMPAIGN COMMITTEE", "526 U.S. 603": "CHARLES H. WILSON, ET UX., et al. v. HARRY LAYNE, DEPUTY UNITED STATES MARSHAL, ETC., et al.", "526 U.S. 559": "FLORIDA v. TYVESSEL TYVORUS WHITE", "528 U.S. 470": "ERNEST C. ROE, WARDEN v. LUCIO FLORES-ORTEGA", "536 U.S. 516": "BE & K CONSTRUCTION COMPANY v. NATIONAL LABOR RELATIONS BOARD et al.", "532 U.S. 268": "CLARK COUNTY SCHOOL DISTRICT v. SHIRLEY A. BREEDEN", "529 U.S. 598": "CHRISTY BRZONKALA v. ANTONIO J. MORRISON, et al.", "535 U.S. 654": "ALABAMA v. LEREED SHELTON", "535 U.S. 564": "JOHN ASHCROFT, ATTORNEY GENERAL v. AMERICAN CIVIL LIBERTIES UNION, et al.", "529 U.S. 344": "NORFOLK SOUTHERN RAILWAY COMPANY v. DEDRA SHANKLIN, INDIVIDUALLY, AND AS NEXT FRIEND OF JESSIE GUY SHANKLIN", "528 U.S. 49": "ROHN F. DRYE, JR., et al. v. UNITED STATES", "525 U.S. 316": "WILLIAM JEFFERSON CLINTON, PRESIDENT OF THE UNITED STATES, et al. v. MATTHEW GLAVIN et al.", "519 U.S. 347": "UNITED STATES v. SCOTT", "527 U.S. 516": "VAUGHN L. MURPHY v. UNITED PARCEL SERVICE", "535 U.S. 137": "HOFFMAN PLASTIC COMPOUNDS, INC. v. NATIONAL LABOR RELATIONS BOARD", "529 U.S. 205": "WAL-MART STORES, INC. v. SAMARA BROTHERS, INC.", "526 U.S. 473": "EL PASO NATURAL GAS COMPANY, et al. v. LAURA NEZTSOSIE et al.", "531 U.S. 4": "CHRISTOPHER ARTUZ, SUPERINTENDENT, GREEN HAVEN CORRECTIONAL FACILITY v. TONY BRUCE BENNETT", "526 U.S. 813": "EDDIE RICHARDSON v. UNITED STATES", "535 U.S. 813": "SECURITIES AND EXCHANGE COMMISSION v. CHARLES ZANDFORD", "532 U.S. 141": "DONNA RAE EGELHOFF v. SAMANTHA EGELHOFF, A MINOR, BY AND THROUGH HER NATURAL PARENT KATE BREINER, AND DAVID EGELHOFF", "536 U.S. 238": "UNITED STATES v. FIOR D'ITALIA, INC.", "532 U.S. 822": "UNITED DOMINION INDUSTRIES, INC. v. UNITED STATES", "519 U.S. 408": "MARYLAND v. JERRY LEE WILSON", "532 U.S. 189": "ARTHUR S. LUJAN, LABOR COMMISSIONER OF CALIFORNIA, et al. v. G & G FIRE SPRINKLERS, INC.", "530 U.S. 1": "HARTFORD UNDERWRITERS INSURANCE COMPANY v. UNION PLANTERS BANK, N. A.", "532 U.S. 504": "MAJOR LEAGUE BASEBALL PLAYERS ASSOCIATION v. STEVE GARVEY", "525 U.S. 182": "VICTORIA BUCKLEY, SECRETARY OF STATE OF COLORADO v. AMERICAN CONSTITUTIONAL LAW FOUNDATION, INC., et al.", "530 U.S. 27": "UNITED STATES v. WEBSTER L. HUBBELL", "528 U.S. 152": "SALVADOR MARTINEZ v. COURT OF APPEAL OF CALIFORNIA, FOURTH APPELLATE DISTRICT", "536 U.S. 304": "DARYL RENARD ATKINS v. VIRGINIA", "533 U.S. 194": "DONALD SAUCIER v. ELLIOT M. KATZ AND IN DEFENSE OF ANIMALS", "526 U.S. 160": "SOUTH CENTRAL BELL TELEPHONE COMPANY, et al. v. ALABAMA et al.", "529 U.S. 848": "DEWEY J. JONES v. UNITED STATES", "535 U.S. 357": "TOMMY G. THOMPSON, SECRETARY OF HEALTH AND HUMAN SERVICES, et al. v. WESTERN STATES MEDICAL CENTER et al.", "521 U.S. 1": "UNITED STATES OF AMERICA v. STATE OF ALASKA", "532 U.S. 731": "TIMOTHY BOOTH v. C. O. CHURNER, et al.", "520 U.S. 510": "INTER-MODAL RAIL EMPLOYEES ASSOCIATION, et al. v. ATCHISON, TOPEKA AND SANTA FE RAILWAY COMPANY, et al.", "525 U.S. 366": "A&T CORP. et al. v. CALIFORNIA et al.", "529 U.S. 244": "J. WAYNE GARNER, FORMER CHAIRMAN OF THE STATE BOARD OF PARDONS AND PAROLES OF GEORGIA, et al. v. ROBERT L. JONES", "519 U.S. 355": "D. DEAN BIBLES, DIRECTOR, OREGON BUREAU OF LAND MANAGEMENT v. OREGON NATURAL DESERT ASSOCIATION", "536 U.S. 150": "WATCHTOWER BIBLE AND TRACT SOCIETY OF NEW YORK, INC., et al. v. VILLAGE OF STRATTON et al.", "535 U.S. 425": "CITY OF LOS ANGELES v. ALAMEDA BOOKS, INC., et al.", "534 U.S. 1": "UNITED STATES POSTAL SERVICE v. MARIA A. GREGORY", "529 U.S. 728": "PUBLIC LANDS COUNCIL, et al. v. BRUCE BABBITT, SECRETARY OF THE INTERIOR, et al.", "529 U.S. 1": "DONNA E. SHALALA, SECRETARY OF HEALTH AND HUMAN SERVICES, et al. v. ILLINOIS COUNCIL ON LONG TERM CARE, INC.", "536 U.S. 88": "JPMORGAN CHASE BANK v. TRAFFIC STREAM (BVI) INFRASTRUCTURE LIMITED", "527 U.S. 423": "JEFFERSON COUNTY, ALABAMA v. WILLIAM M. ACKER, JR., SENIOR JUDGE, UNITED STATES DISTRICT COURT, NORTHERN DISTRICT OF ALABAMA, AND U. W. CLEMON, JUDGE, UNITED STATES DISTRICT COURT, NORTHERN DISTRICT OF ALABAMA", "528 U.S. 440": "CHAD WEISGRAM, et al. v. MARLEY COMPANY, et al.", "520 U.S. 953": "ASSOCIATES COMMERCIAL CORPORATION v. ELRAY RASH ET UX.", "530 U.S. 238": "HARRIS TRUST AND SAVINGS BANK, ETC., et al. v. SALOMON SMITH BARNEY INC., et al.", "526 U.S. 86": "FEDERAL LABOR RELATIONS AUTHORITY v. DEPARTMENT OF THE INTERIOR et al.", "527 U.S. 263": "TOMMY DAVID STRICKLER v. FRED W. GREENE, WARDEN", "528 U.S. 549": "MARK ROTELLA v. ANGELA M. WOOD, et al.", "532 U.S. 661": "PGA TOUR, INC. v. CASEY MARTIN", "528 U.S. 259": "GEORGE SMITH, WARDEN v. LEE ROBBINS", "532 U.S. 234": "ALFRED SMALLWOOD, et al. v. MARTIN CROMARTIE, et al.", "534 U.S. 426": "OWASSO INDEPENDENT SCHOOL DISTRICT NO. I-011, AKA OWASSO PUBLIC SCHOOLS, et al. v. KRISTJA J. FALVO, PARENT AND NEXT FRIEND OF HER MINOR CHILDREN, ELIZABETH PLETAN, PHILIP PLETAN, AND ERICA PLETAN", "525 U.S. 121": "MICHAEL A. HADDLE v. JEANETTE G. GARRISON, et al.", "520 U.S. 273": "THOMAS YOUNG, et al. v. KIRK FORDICE et al.", "532 U.S. 645": "ATKINSON TRADING COMPANY, INC. v. JOE SHIRLEY, JR., et al.", "529 U.S. 362": "TERRY WILLIAMS v. JOHN TAYLOR, WARDEN", "521 U.S. 261": "IDAHO, et al. v. COEUR D'ALENE TRIBE OF IDAHO, ETC., et al.", "534 U.S. 279": "EQUAL EMPLOYMENT OPPORTUNITY COMMISSION v. WAFFLE HOUSE, INC.", "527 U.S. 666": "COLLEGE SAVINGS BANK v. FLORIDA PREPAID POSTSECONDARY EDUCATION EXPENSE BOARD et al.", "519 U.S. 234": "BRUCE BABBITT, SECRETARY OF THE INTERIOR, et al. v. MARVIN K. YOUPEE, SR., et al.", "520 U.S. 1": "UNITED STATES v. MIGUEL GONZALES, ORLENIS HERNANDEZ-DIAZ AND MARIO PEREZ", "527 U.S. 526": "CAROLE KOLSTAD v. AMERICAN DENTAL ASSOCIATION", "520 U.S. 17": "WARNER-JENKINSON COMPANY, INC., et al. v. HILTON DAVIS CHEMICAL CO.", "521 U.S. 507": "CITY OF BOERNE v. P. F. FLORES, ARCHBISHOP OF SAN ANTONIO, AND UNITED STATES", "537 U.S. 51": "REX R. SPRIETSMA, ADMINISTRATOR OF THE ESTATE OF JEANNE SPRIETSMA, DECEASED v. MERCURY MARINE, A DIVISION OF BRUNSWICK CORPORATION", "533 U.S. 218": "UNITED STATES v. MEAD CORPORATION", "520 U.S. 518": "CARY MICHAEL LAMBRIX v. HARRY K. SINGLETARY, JR., SECRETARY, FLORIDA DEPARTMENT OF CORRECTIONS", "529 U.S. 120": "FOOD AND DRUG ADMINISTRATION, et al. v. BROWN & WILLIAMSON TOBACCO CORPORATION, et al.", "536 U.S. 403": "WARREN CHRISTOPHER, FORMER SECRETARY OF STATE, et al. v. JENNIFER K. HARBURY", "528 U.S. 377": "JEREMIAH W. (JAY) NIXON, ATTORNEY GENERAL OF MISSOURI, et al. v. SHRINK MISSOURI GOVERNMENT PAC et al.", "532 U.S. 483": "UNITED STATES v. OAKLAND CANNABIS BUYERS' COOPERATIVE AND JEFFREY JONES", "519 U.S. 278": "GENERAL MOTORS CORPORATION v. ROGER W. TRACY, TAX COMMISSIONER OF OHIO", "528 U.S. 167": "FRIENDS OF THE EARTH, INCORPORATED, et al. v. LAIDLAW ENVIRONMENTAL SERVICES (TOC), INC.", "526 U.S. 275": "UNITED STATES v. JACINTO RODRIGUEZ-MORENO", "520 U.S. 351": "MICHELE L. TIMMONS, ACTING DIRECTOR, RAMSEY COUNTY DEPARTMENT OF PROPERTY RECORDS AND REVENUE, et al. v. TWIN CITIES AREA NEW PARTY", "533 U.S. 525": "ALTADIS U.S.A. INC., ETC., et al. v. THOMAS F. REILLY, ATTORNEY GENERAL OF MASSACHUSETTS, et al.", "531 U.S. 12": "CARL W. CLEVELAND v. UNITED STATES", "535 U.S. 302": "TAHOE-SIERRA PRESERVATION COUNCIL, INC., et al. v. TAHOE REGIONAL PLANNING AGENCY et al.", "520 U.S. 781": "WALTER MCMILLIAN v. MONROE COUNTY, ALABAMA", "534 U.S. 407": "KANSAS v. MICHAEL T. CRANE", "520 U.S. 259": "UNITED STATES v. DAVID W. LANIER", "520 U.S. 385": "STEINEY RICHARDS v. WISCONSIN", "530 U.S. 15": "THOMAS E. RALEIGH, CHAPTER 7 TRUSTEE FOR THE ESTATE OF WILLIAM J. STOECKER, v. ILLINOIS DEPARTMENT OF REVENUE", "531 U.S. 288": "BRENTWOOD ACADEMY v. TENNESSEE SECONDARY SCHOOL ATHLETIC ASSOCIATION, et al.", "526 U.S. 380": "UNITED STATES v. HAGGAR APPAREL COMPANY", "519 U.S. 465": "WILLIAM C. DUNN AND DELTA CONSULTANTS, INC. v. COMMODITY FUTURES TRADING COMMISSION et al.", "529 U.S. 89": "INTERNATIONAL ASSOCIATION OF INDEPENDENT TANKER OWNERS (INTERTANKO) v. GARY LOCKE, GOVERNOR OF WASHINGTON, et al.", "529 U.S. 334": "STEVEN DEWAYNE BOND v. UNITED STATES", "530 U.S. 363": "STEPHEN P. CROSBY, SECRETARY OF ADMINISTRATION AND FINANCE OF MASSACHUSETTS, et al., v. NATIONAL FOREIGN TRADE COUNCIL", "532 U.S. 67": "CRYSTAL M. FERGUSON, et al. v. CITY OF CHARLESTON et al.", "520 U.S. 564": "CAMPS NEWFOUND/OWATONNA, INC. v. TOWN OF HARRISON, MAINE, et al.", "528 U.S. 119": "ILLINOIS v. WILLIAM AKA SAM WARDLOW", "534 U.S. 161": "LARRY DEAN DUSENBERY v. UNITED STATES", "537 U.S. 1": "FORD MOTOR COMPANY AND CITIBANK (SOUTH DAKOTA), N. A. v. JOHN B. MCCAULEY et al.", "535 U.S. 106": "LEONARD EDELMAN v. LYNCHBURG COLLEGE", "526 U.S. 629": "AURELIA DAVIS, AS NEXT FRIEND OF LASHONDA D. v. MONROE COUNTY BOARD OF EDUCATION et al.", "527 U.S. 173": "GREATER NEW ORLEANS BROADCASTING ASSOCIATION, INC., ETC., et al. v. UNITED STATES et al.", "535 U.S. 1": "ENRON POWER MARKETING, INC. v. FEDERAL ENERGY REGULATORY COMMISSION et al.", "530 U.S. 290": "SANTA FE INDEPENDENT SCHOOL DISTRICT v. JANE DOE, INDIVIDUALLY AND AS NEXT FRIEND FOR HER MINOR CHILDREN, JANE AND JOHN DOE, et al.", "527 U.S. 555": "ALBERTSON'S, INC. v. HALLIE KIRKINGBURG", "531 U.S. 533": "UNITED STATES v. CARMEN VELAZQUEZ, et al.", "530 U.S. 133": "ROGER REEVES v. SANDERSON PLUMBING PRODUCTS, INC.", "529 U.S. 861": "ALEXIS GEIER, et al. v. AMERICAN HONDA MOTOR COMPANY, INC., et al.", "519 U.S. 452": "FRANCIS BERNARD AUER, et al. v. DAVID A. ROBBINS et al.", "520 U.S. 670": "UNITED STATES v. ROBERT E. HYDE", "530 U.S. 567": "CALIFORNIA DEMOCRATIC PARTY, et al. v. BILL JONES, SECRETARY OF STATE OF CALIFORNIA, et al.", "531 U.S. 341": "BUCKMAN COMPANY v. Plaintiffs' LEGAL COMMITTEE", "519 U.S. 202": "LEONARD BIEBER EQUAL EMPLOYMENT OPPORTUNITY COMMISSION v. METROPOLITAN EDUCATIONAL ENTERPRISES, INC., AND LEONARD BIEBER", "519 U.S. 233": "TOM GRIMMETT, TRUSTEE FOR THE BANKRUPTCY ESTATE OF VINCENT SIRAGUSA, AND JOANNE SIRAGUSA v. PATRICIA L. BROWN et al.", "529 U.S. 765": "VERMONT AGENCY OF NATURAL RESOURCES v. UNITED STATES, EX REL., JONATHAN STEVENS", "526 U.S. 489": "RITA L. SAENZ, DIRECTOR, CALIFORNIA DEPARTMENT OF SOCIAL SERVICES, et al. v. BRENDA ROE AND ANNA DOE ETC.", "535 U.S. 162": "WALTER MICKENS, JR. v. JOHN TAYLOR, WARDEN", "532 U.S. 706": "NATIONAL LABOR RELATIONS BOARD v. KENTUCKY RIVER COMMUNITY CARE, INC., et al.", "525 U.S. 113": "PATRICK KNOWLES v. IOWA", "520 U.S. 681": "WILLIAM JEFFERSON CLINTON v. PAULA CORBIN JONES", "529 U.S. 667": "JEFFREY ALLAN FISCHER v. UNITED STATES", "522 U.S. 75": "MELVIN JEFFERSON, INDIVIDUALLY AND AS ADMINISTRATOR OF THE ESTATE OF ALBERTA K. JEFFERSON, DECEASED, et al. v. CITY OF TARRANT, ALABAMA", "527 U.S. 706": "JOHN H. ALDEN, et al. v. MAINE", "525 U.S. 55": "WAYNE K. PFAFF v. WELLS ELECTRONICS, INC.", "528 U.S. 225": "LONNIE WEEKS, JR. v. RONALD J. ANGELONE, DIRECTOR, VIRGINIA DEPARTMENT OF CORRECTIONS", "534 U.S. 204": "GREAT-WEST LIFE & ANNUITY INSURANCE COMPANY, et al. v. JANETTE KNUDSON AND ERIC KNUDSON", "521 U.S. 424": "METRO-NORTH COMMUTER RAILROAD COMPANY v. MICHAEL BUCKLEY", "531 U.S. 278": "CITY NEWS AND NOVELTY, INC. v. CITY OF WAUKESHA", "519 U.S. 433": "KENNETH LYNCE v. HAMILTON MATHIS, SUPERINTENDENT, TOMOKA CORRECTIONAL INSTITUTION, et al.", "528 U.S. 32": "LOS ANGELES POLICE DEPARTMENT v. UNITED REPORTING PUBLISHING CORPORATION", "531 U.S. 316": "DIRECTOR OF REVENUE OF MISSOURI v. COBANK ACB, AS SUCCESSOR TO THE NATIONAL BANK OF COOPERATIVES", "531 U.S. 28": "JAMES BENNETT, SECRETARY OF STATE OF ALABAMA, et al. v. PEGGY C. KELLEY, et al.", "534 U.S. 533": "LANCE RAYGOR AND JAMES GOODCHILD v. REGENTS OF THE UNIVERSITY OF MINNESOTA, et al.", "530 U.S. 703": "LEILA JEANNE HILL, AUDREY HIMMELMANN, AND EVERITT W. SIMPSON, JR. v. COLORADO, et al.", "532 U.S. 757": "DALE G. BECKER v. BETTY MONTGOMERY, ATTORNEY GENERAL OF OHIO, et al.", "526 U.S. 756": "CALIFORNIA DENTAL ASSOCIATION v. FEDERAL TRADE COMMISSION", "533 U.S. 146": "ALABAMA v. MICHAEL HERMAN BOZEMAN", "535 U.S. 229": "SAO PAULO STATE OF THE FEDERATIVE REPUBLIC OF BRAZIL v. AMERICAN TOBACCO CO., INC., et al.", "522 U.S. 23": "GARRIT BATES v. UNITED STATES", "536 U.S. 622": "UNITED STATES v. ANGELA RUIZ", "536 U.S. 545": "WILLIAM JOSEPH HARRIS v. UNITED STATES", "535 U.S. 685": "RICKY BELL, WARDEN v. GARY BRADFORD CONE", "535 U.S. 613": "PAUL D. LAPIDES v. BOARD OF REGENTS OF THE UNIVERSITY SYSTEM OF GEORGIA, et al.", "532 U.S. 162": "TEXAS v. RAYMOND LEVI COBB", "533 U.S. 53": "TUAN ANH NGUYEN AND JOSEPH BOULAIS v. IMMIGRATION AND NATURALIZATION SERVICE", "534 U.S. 103": "ADARAND CONSTRUCTORS, INC. v. NORMAN Y. MINETA, SECRETARY OF TRANSPORTATION, et al.", "536 U.S. 639": "SENEL TAYLOR, et al. v. DORIS SIMMONS-HARRIS et al.", "535 U.S. 635": "UNITED STATES v. PUBLIC SERVICE COMMISSION OF MARYLAND et al.", "528 U.S. 250": "CARL T. C. GUTIERREZ AND MADELEINE Z. BORDALLO v. JOSEPH F. ADA AND FELIX P. CAMACHO", "529 U.S. 460": "DONALD E. NELSON v. ADAMS, USA, INC., et al.", "533 U.S. 167": "GEORGE DUNCAN, SUPERINTENDENT, GREAT MEADOW CORRECTIONAL FACILITY v. SHERMAN WALKER", "529 U.S. 217": "BOARD OF REGENTS OF THE UNIVERSITY OF WISCONSIN SYSTEM v. SCOTT HAROLD SOUTHWORTH, et al.", "526 U.S. 434": "BANK OF AMERICA NATIONAL TRUST AND SAVINGS ASSOCIATION v. 203 NORTH LASALLE STREET PARTNERSHIP", "525 U.S. 459": "NATIONAL COLLEGIATE ATHLETIC ASSOCIATION v. R. M. SMITH", "534 U.S. 506": "AKOS SWIERKIEWICZ v. SOREMA N. A.", "529 U.S. 193": "CORTEZ BYRD CHIPS, INC. v. BILL HARBERT CONSTRUCTION COMPANY, ETC.", "534 U.S. 327": "FEDERAL COMMUNICATIONS COMMISSION AND UNITED STATES v. GULF POWER COMPANY et al.", "521 U.S. 567": "C. MARTIN LAWYER, III v. DEPARTMENT OF JUSTICE et al.", "528 U.S. 458": "HUNT-WESSON, INC. v. FRANCHISE TAX BOARD OF CALIFORNIA", "520 U.S. 154": "BRAD BENNETT, et al. v. MICHAEL SPEAR, et al.", "525 U.S. 449": "YOUR HOME VISITING NURSE SERVICES, INC. v. DONNA E. SHALALA, SECRETARY OF HEALTH AND HUMAN SERVICES", "531 U.S. 98": "GEORGE W. BUSH AND RICHARD CHENEY v. ALBERT GORE, JR., et al.", "532 U.S. 774": "FLORIDA v. ROBERT A. THOMAS", "531 U.S. 287": "DISTRICT OF COLUMBIA, et al., v. TRI COUNTY INDUSTRIES, INC.", "535 U.S. 234": "JOHN D. ASHCROFT, ATTORNEY GENERAL, et al. v. THE FREE SPEECH COALITION et al.", "533 U.S. 678": "JOHN D. ASHCROFT, ATTORNEY GENERAL, et al. v. KIM HO MA", "532 U.S. 374": "EARTHY D. DANIELS, JR. v. UNITED STATES", "536 U.S. 129": "GRASS VALLEY TERRACE, et al. v. UNITED STATES", "529 U.S. 61": "LEONARD PORTUONDO, SUPERINTENDENT, FISHKILL CORRECTIONAL FACILITY v. RAY AGARD", "529 U.S. 446": "RONALD D. EDWARDS, WARDEN v. ROBERT W. CARPENTER", "534 U.S. 184": "TOYOTA MOTOR MANUFACTURING, KENTUCKY, INC. v. ELLA WILLIAMS", "529 U.S. 420": "MICHAEL WAYNE WILLIAMS v. JOHN TAYLOR, WARDEN", "529 U.S. 266": "FLORIDA v. J. L.", "531 U.S. 159": "SOLID WASTE AGENCY OF NORTHERN COOK COUNTY v. UNITED STATES ARMY CORPS OF ENGINEERS, et al.", "521 U.S. 121": "METROPOLITAN STEVEDORE COMPANY v. JOHN RAMBO et al.", "530 U.S. 103": "JUATASSA SIMS v. KENNETH S. APFEL, COMMISSIONER OF SOCIAL SECURITY", "530 U.S. 914": "DON STENBERG, ATTORNEY GENERAL OF NEBRASKA, et al. v. LEROY CARHART", "529 U.S. 494": "ROBERT A. BECK, II v. RONALD M. PRUPIS, et al.", "532 U.S. 23": "TRAFFIX DEVICES, INC. v. MARKETING DISPLAYS, INC.", "532 U.S. 394": "LACKAWANNA COUNTY DISTRICT ATTORNEY, et al. v. EDWARD R. COSS, JR.", "536 U.S. 214": "TOM L. CAREY, WARDEN v. TONY EUGENE SAFFOLD", "532 U.S. 811": "NORFOLK SHIPBUILDING & DRYDOCK CORPORATION v. CELESTINE GARRIS, ADMINISTRATRIX OF THE ESTATE OF CHRISTOPHER GARRIS, DECEASED", "535 U.S. 212": "JO ANNE B. BARNHART, COMMISSIONER OF SOCIAL SECURITY v. CLEVELAND B. WALTON", "536 U.S. 856": "TERRY L. STEWART, DIRECTOR, ARIZONA DEPARTMENT OF CORRECTIONS v. ROBERT DOUGLAS SMITH", "519 U.S. 248": "INGALLS SHIPBUILDING, INC., et al. v. DIRECTOR, OFFICE OF WORKERS' COMPENSATION PROGRAMS, DEPARTMENT OF LABOR, et al.", "526 U.S. 415": "IMMIGRATION AND NATURALIZATION SERVICE v. JUAN ANIBAL AGUIRRE-AGUIRRE", "536 U.S. 822": "BOARD OF EDUCATION OF INDEPENDENT SCHOOL DISTRICT NO. 92 OF POTTAWATOMIE COUNTY, et al. v. LINDSAY EARLS et al.", "520 U.S. 875": "SARATOGA FISHING COMPANY v. J. M. MARTINAC & COMPANY AND MARCO SEATTLE INC.", "526 U.S. 687": "CITY OF MONTEREY v. DEL MONTE DUNES AT MONTEREY, LTD., AND MONTEREY-DEL MONTE DUNES CORPORATION", "521 U.S. 74": "UNITED STATES v. DAVIDA JOHNSON et al.", "535 U.S. 228": "WANDA ADAMS, et al. v. FLORIDA POWER CORPORATION AND FLORIDA PROGRESS CORPORATION", "532 U.S. 223": "ROBERT SHAW, et al. v. KEVIN MURPHY", "522 U.S. 3": "STATE OIL COMPANY v. BARKAT U. KHAN AND KHAN & ASSOCIATES, INC.", "532 U.S. 557": "UNITED STATES v. TERRY J. HATTER, JR., JUDGE, UNITED STATES DISTRICT COURT FOR THE CENTRAL DISTRICT OF CALIFORNIA, et al.", "526 U.S. 286": "DAVID CONN AND CAROL NAJERA v. PAUL L. GABBERT", "528 U.S. 304": "UNITED STATES v. ABEL MARTINEZ-SALAZAR", "520 U.S. 438": "WILLIAM STRATE, ASSOCIATE TRIBAL JUDGE, TRIBAL COURT OF THE THREE AFFILIATED TRIBES OF THE FORT BERTHOLD INDIAN RESERVATION, et al. v. A-1 CONTRACTORS AND LYLE STOCKERT", "534 U.S. 235": "ELAINE L. CHAO, SECRETARY OF LABOR v. MALLARD BAY DRILLING, INC.", "535 U.S. 81": "TRACY RAGSDALE, et al. v. WOLVERINE WORLD WIDE, INC.", "525 U.S. 70": "CEASAR WRIGHT v. UNIVERSAL MARITIME SERVICE CORPORATION et al.", "522 U.S. 136": "GENERAL ELECTRIC COMPANY, et al. v. ROBERT K. JOINER ET UX.", "521 U.S. 151": "JOSEPH ROGER O'DELL, III v. J. D. NETHERLAND, WARDEN, et al.", "522 U.S. 156": "CITY OF CHICAGO, et al. v. INTERNATIONAL COLLEGE OF SURGEONS et al.", "521 U.S. 346": "LEROY HENDRICKS v. KANSAS", "534 U.S. 84": "CHOCTAW NATION OF OKLAHOMA v. UNITED STATES", "531 U.S. 497": "SEMTEK INTERNATIONAL INCORPORATED v. LOCKHEED MARTIN CORPORATION", "535 U.S. 789": "GARY E. GISBRECHT, BARBARA A. MILLER, AND NANCY SANDINE v. JO ANNE B. BARNHART, COMMISSIONER OF SOCIAL SECURITY", "536 U.S. 730": "LARRY HOPE v. MARK PELZER et al.", "531 U.S. 326": "ILLINOIS v. CHARLES MCARTHUR", "531 U.S. 510": "REBECCA MCDOWELL COOK v. DONALD J. GRALIKE AND MIKE HARMAN", "535 U.S. 826": "THE HOLMES GROUP, INC. v. VORNADO AIR CIRCULATION SYSTEMS, INC.", "525 U.S. 33": "NAOMI MARQUEZ v. SCREEN ACTORS GUILD, INC., et al.", "530 U.S. 327": "UNITED STATES v. RICHARD A. FRENCH, et al.", "527 U.S. 343": "BILL MARTIN, DIRECTOR, MICHIGAN DEPARTMENT OF CORRECTIONS, et al. v. EVERETT HADIX et al.", "533 U.S. 405": "UNITED STATES AND DEPARTMENT OF AGRICULTURE v. UNITED FOODS, INC.", "536 U.S. 273": "GONZAGA UNIVERSITY AND ROBERTA S. LEAGUE v. JOHN DOE", "532 U.S. 411": "C & L ENTERPRISES, INC. v. CITIZEN BAND POTAWATOMI INDIAN TRIBE OF OKLAHOMA", "525 U.S. 255": "DEPARTMENT OF THE ARMY v. BLUE FOX, INC.", "533 U.S. 656": "MELVIN TYLER v. BURL CAIN, WARDEN", "520 U.S. 911": "MARIAN JOHNSON, et al. v. KRISTINE L. FANKELL", "522 U.S. 93": "JOHN HUDSON, LARRY BARESEL, AND JACK BUTLER RACKLEY v. UNITED STATES", "527 U.S. 1": "ELLIS E. NEDER, JR. v. UNITED STATES", "532 U.S. 200": "UNITED STATES v. CLEVELAND INDIANS BASEBALL COMPANY", "527 U.S. 198": "TERESA L. CUNNINGHAM v. HAMILTON COUNTY, OHIO", "528 U.S. 495": "HAROLD F. RICE v. BENJAMIN J. CAYETANO, GOVERNOR OF HAWAII", "528 U.S. 110": "NEW YORK v. MICHAEL HILL", "535 U.S. 55": "UNITED STATES v. ALPHONSO VONN", "533 U.S. 483": "NEW YORK TIMES COMPANY, INC., et al. v. JONATHAN TASINI, et al.", "537 U.S. 28": "SYNGENTA CROP PROTECTION, INC., ROBERT BABB, EDEE TEMPLET, AND KENNETH A. DEVUN v. HURLEY HENSON", "531 U.S. 79": "GREEN TREE FINANCIAL CORP.-ALABAMA AND GREEN TREE FINANCIAL CORPORATION v. LARKETTA RANDOLPH", "534 U.S. 473": "WISCONSIN DEPARTMENT OF HEALTH AND FAMILY SERVICES v. IRENE BLUMER", "528 U.S. 320": "GEORGE PRICE, et al. v. BOSSIER PARISH SCHOOL BOARD", "527 U.S. 471": "KAREN SUTTON AND KIMBERLY HINTON v. UNITED AIR LINES, INC.", "526 U.S. 66": "CEDAR RAPIDS COMMUNITY SCHOOL DISTRICT v. GARRET F., A MINOR BY HIS MOTHER AND NEXT FRIEND, CHARLENE F.", "520 U.S. 751": "UNITED STATES v. GEORGE LABONTE, ALFRED LAWRENCE HUNNEWELL, AND STEPHEN DYER", "527 U.S. 116": "BENJAMIN LEE LILLY v. VIRGINIA", "535 U.S. 274": "UNITED STATES v. SANDRA L. CRAFT", "536 U.S. 355": "RUSH PRUDENTIAL HMO, INC. v. DEBRA C. MORAN et al.", "521 U.S. 457": "DAN GLICKMAN, SECRETARY OF AGRICULTURE v. WILEMAN BROTHERS & ELLIOTT, INC., et al.", "527 U.S. 815": "ESTEBAN ORTIZ, et al. v. FIBREBOARD CORPORATION, et al.", "526 U.S. 541": "JAMES B. HUNT, JR., GOVERNOR OF NORTH CAROLINA, et al. v. MARTIN CROMARTIE et al.", "526 U.S. 23": "MANUEL DEJESUS PEGUERO v. UNITED STATES", "532 U.S. 17": "OHIO v. MATTHEW REINER", "536 U.S. 24": "DAVID R. MCKUNE, WARDEN, et al. v. ROBERT G. LILE", "522 U.S. 52": "MARIO SALINAS v. UNITED STATES", "532 U.S. 514": "UNITED STATES v. VOPPER, AKA WILLIAMS, et al.", "530 U.S. 604": "MARATHON OIL COMPANY v. UNITED STATES", "532 U.S. 769": "ARKANSAS v. KENNETH ANDREW SULLIVAN", "521 U.S. 793": "DENNIS C. VACCO, ATTORNEY GENERAL OF NEW YORK, et al. v. TIMOTHY E. QUILL et al.", "535 U.S. 125": "OAKLAND HOUSING AUTHORITY, et al. v. PEARLIE RUCKER et al.", "535 U.S. 467": "GENERAL COMMUNICATIONS, INC. v. IOWA UTILITIES BOARD, et al.", "535 U.S. 722": "FESTO CORPORATION v. SHOKETSU KINZOKU KOGYO KABUSHIKI CO., LTD., et al.", "527 U.S. 212": "TOGO D. WEST, JR., SECRETARY OF VETERANS AFFAIRS v. MICHAEL GIBSON", "521 U.S. 811": "FREDERICK D. RAINES, DIRECTOR, OFFICE OF MANAGEMENT AND BUDGET, et al. v. ROBERT C. BYRD et al.", "520 U.S. 471": "GEORGE PRICE, et al. v. BOSSIER PARISH SCHOOL BOARD et al.", "521 U.S. 591": "AMCHEM PRODUCTS, INC., et al. v. GEORGE WINDSOR et al.", "527 U.S. 150": "Q. TODD DICKINSON, ACTING COMMISSIONER OF PATENTS AND TRADEMARKS v. MARY E. ZURKO et al.", "536 U.S. 584": "TIMOTHY STUART RING v. ARIZONA", "526 U.S. 314": "AMANDA MITCHELL v. UNITED STATES", "534 U.S. 438": "JO ANNE B. BARNHART, COMMISSIONER OF SOCIAL SECURITY v. SIGMON COAL COMPANY, INC., et al.", "522 U.S. 192": "BAY AREA LAUNDRY AND DRY CLEANING PENSION TRUST FUND v. FERBAR CORPORATION OF CALIFORNIA, INC., AND STEPHEN BARNES", "530 U.S. 255": "FLOYD J. CARTER v. UNITED STATES", "525 U.S. 155": "EL AL ISRAEL AIRLINES, LTD. v. TSUI YUAN TSENG"}